{
  "backend/main.mo": "Main Motoko actor defining the backend with access control, blob storage, and data models for poets, poetry content, user profiles, and Indian states/UTs; includes CRUD operations for poets and user profiles with authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: website rebranding to 'SahityaAurShabd', adding a colored India map background, and refining state/UT card positioning on the map.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React app structure, language context with 'SahityaAurShabd' translations, interactive India map with 37 state/UT cards, poet profile pages, and warm Indian-inspired color system.",
  "frontend/index.css": "Tailwind CSS base styles defining light and dark mode color schemes using OKLCH color space with custom CSS variables for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with page title 'SahityaAurShabd - Indian Poetry Platform' and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for home, poet profiles, and owner poetry pages, wrapped in ThemeProvider and LanguageProvider with Toaster for notifications.",
  "frontend/src/components/IndiaMap.tsx": "Interactive India map component rendering 37 clickable state/UT cards with refined geographic positioning over a background map image (30% opacity), using unique colors and hover effects for each region.",
  "frontend/src/components/LanguageToggle.tsx": "Button component for toggling between English and Hindi languages, displaying the opposite language name as the button label with a Languages icon.",
  "frontend/src/components/Layout.tsx": "Root layout component with header displaying 'SahityaAurShabd' branding and navigation, decorative poetry background pattern, main content outlet, and footer with caffeine.ai attribution.",
  "frontend/src/components/PoetrySectionCard.tsx": "Displays poetry content cards for a specific poet and category, rendering text, images, videos, audio, and visual assets with loading skeletons and empty states.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides bilingual (English/Hindi) language context with translations for UI labels, navigation, Indian states/UTs, poetry categories, and common messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching poet data, main poet, poems by category, and all poets from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with warm Indian-inspired color palettes for light/dark modes, including 36 map colors for India's states/UTs and custom fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with a welcome message and interactive India map for exploring poets by region.",
  "frontend/src/pages/OwnerPoetryPage.tsx": "Displays the website owner's poetry profile with a distinguished design featuring a crown icon, gradient background, and tabs for different content categories (ghazals, kavitas, shers, etc.). Fetches main poet data and renders biography, genres, and awards with special styling to differentiate from regular poet profiles.",
  "frontend/src/pages/PoetProfilePage.tsx": "Displays individual poet profiles based on state/UT parameter from the URL. Shows poet avatar, biography, website link, genres, awards, and tabbed sections for different poetry categories (ghazals, kavitas, shers, nazms, etc.).",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, including theme colors (primary, secondary, accent), sidebar colors, and a 21-color palette for the India map regions. Extends default theme with container settings, typography, and animation plugins.",
  "project_state.json": "Project metadata describing a bilingual Hindi-English poetry website featuring poets from all Indian states/UTs with an interactive map. Documents existing features including the interactive India map, bilingual support, poet profiles, owner poetry section, and culturally appropriate UI design."
}